[{"title": "Mexico City", "link": "https://simple.wikipedia.org/wiki/Mexico%20City", "body": "Mexico City () is the capital and largest city of Mexico. It is also one of the most populous and polluted cities in the world. The Aztec people were here before the Spanish came and made Mexico City. It was founded in 1521 by Hernán Cortés. Today, about 8.5 million people live in the city, and about 18 million live in the Greater Mexico City urban area. The city of Mexico City ceased to exist in 1928. Since then, there is only the Federal District.\n\nMexico City has 18.1 million people. It is the city with the second highest number of people in the world after Tokyo in Japan and just slightly more populated than Mumbai in India.\n\nHistory\n\nMexico City was first built in the 1520s after Hernán Cortés destroyed the Aztec city of Tenochtitlan. The Spaniards then emptied the basin of Lake Texcoco to keep it from flooding. By the late 1700s, Mexico City had over 100,000 people. However, there were many slums, which caused epidemics. There were political problems in the mid 1800s after Mexico became independent. Mor"}, {"title": "Mexico", "link": "https://simple.wikipedia.org/wiki/Mexico", "body": "Mexico (; official name: United Mexican States , ) is a country in North America. Mexico is south of Texas, California and other American states. Guatemala and Belize are south of Mexico. Mexico is between the Pacific Ocean and the Gulf of Mexico.\n\nPeople living in Mexico or who are from there are called Mexicans. Most Mexican people speak Spanish. There are also Mexicans who speak Native American languages, like Nahuatl, Mayan, and Zapotec. The capital of Mexico is Mexico City.\n\nHistory\n\nBefore the Europeans came, many Native American cultures existed in Mexico. The earliest was the Olmec culture in the south. The Olmecs are famous for the large stone heads they made. On the Yucatán peninsula lived the Mayans. The Mayans lived in city states ruled by kings. The Mayans were most powerful between 200 and 900 A.D. Another powerful empire belonged to Teotihuacan. Teotihuacan was a very large city, one of the largest at that time. After Teotihuacan declined the Toltecs became powerful. Things made by the Toltecs "}, {"title": "New Mexico", "link": "https://simple.wikipedia.org/wiki/New%20Mexico", "body": "New Mexico is a state of the United States of America. It is considered part of the American Southwest and is bordered by Texas to the east, Oklahoma to the northeast, Colorado to the north, and Arizona to the west. The northwest corner of the state also touches Utah. This area is known as the Four Corners because four states meet there. The state has the nickname Land of Enchantment. It has been inhabited since ancient times by the Pueblo people, it was first named and founded as Nuevo México (New Mexico) in the 1500s by Spain. The state’s ancient Native American and Hispanic history have given New Mexico a unique food type called New Mexican cuisine, and a distinct music style called New Mexico music.\n\nNew Mexico became a state on 6 January 1912 and became the 47th state accepted into the United States. The state capital is Santa Fe. New Mexico's population is 2,096,829 as of the July 1, 2019 population estimate from the U.S. Census Bureau. Most of the people live in the biggest city, Albuquerque. New Mexic"}, {"title": "Mexico (state)", "link": "https://simple.wikipedia.org/wiki/Mexico%20%28state%29", "body": "The state of México is one of the administrative divisions of the country of Mexico. It is one of 32 administrative divisions. It is in the centre of the country. It borders Hidalgo, Querétaro, Tlaxcala, Puebla, Michoacán, Morelos and Guerrero as well as Mexico City. The capital of the state is Toluca. Its biggest city is Ecatepec de Morelos, which borders Mexico Federal district. Teotihuacan is also in this state. It is about 21.355 km²  in surface. About 14 million people live there as of 2005.\n\n \nStates of Mexico"}, {"title": "Aztecs", "link": "https://simple.wikipedia.org/wiki/Aztecs", "body": "The Aztecs were Native American people who lived in Mesoamerica. They ruled the Aztec Empire from the 14th century to the 16th century.\n\nThe name \"Aztec\" comes from the phrase \"people from Aztlan\". Legends say that Aztlan was the first place the Aztecs ever lived.  \"Aztlan\" means \"place of the herons\" in the Nahuatl language.p. 8\n\nOften the term \"Aztec\" refers just to the people of Tenochtitlan. This was a city on an island in Lake Texcoco. These people called themselves the Mexica which is why the country is called Mexico, or the Nahua which is why their language is called Nahuatl.\n\nHistory \nBefore the Aztec Empire conquered them, the indigenous (native) people  lived in many separate city-states.  These were small cities with farmland around them.  Each state had its own ruler.  Around 1100 AD, these city-states started to fight each other for power and control of the area's resources.\n\nHistorians think the Aztecs came to central Mesoamerica around 1200.  They came from what is now northwest Mexico.  Accord"}, {"title": "Tenochtitlan", "link": "https://simple.wikipedia.org/wiki/Tenochtitlan", "body": "Tenochtitlan was the capital city of the Aztec Empire.  The Aztecs built Tenochtitlan around 1325, right on a lake called Lake Texcoco.\n\nAs the Empire grew, so did Tenochtitlan.  By the early 1500s, at least 200,000 people lived in the city.  This made Tenochtitlan the largest city in the Americas before Christopher Columbus arrived.\n\nCenter of the Aztec Empire\n\nTenochtitlan was the center of the Aztec government and religion.  It was also a very big trading center.  When the Spanish arrived in 1519, they guessed that 60,000 people came to the market in Tenochtitlan every day.  People bought and sold many things there, including slaves (prisoners of war from states the Aztecs had taken over).  The entire city was decorated with art, architecture, and stone sculptures.\n\nThe Great Temple\n\nThe city had a huge pyramid called the Templo Mayor (Great Temple).  At the top of the Temple, there were two small rooms.  In these rooms, the Aztecs sacrificed people to two of their most important gods: Huitzilopochtli, the"}, {"title": "Mexican–American War", "link": "https://simple.wikipedia.org/wiki/Mexican%E2%80%93American%20War", "body": "The Mexican–American War took place between 1846 and 1848 between  United States  and Mexico.\n\nCauses\n\nWhen Mexico got independence from Spain in 1821, Texas was part of Mexico. Americans and other settlers came into Texas when Mexico allowed non-Spanish settlers to settle there.\n\nAfter many settlers came to Texas, disputes led to the Texas Revolution in 1836, when Texas became independent. Mexico refused to recognize the Republic of Texas, as an independent country. Texas soon asked to join the United States.\n\nThe United States moved quickly to annex Texas after the 1844 election of James K. Polk. In his campaign, Polk had called for the \"re-annexation\" of Texas and the \"re-occupation\" of the Oregon Territory. Polk also wanted California and the rest of what is now the Southwestern United States.\n\nIn 1845, the United States annexed Texas. However, Mexico still did not recognize its independence or recognize the annexation. The US offered to buy from Mexico the land extending from Texas to the Pacific Ocean, "}, {"title": "Carlos Fuentes", "link": "https://simple.wikipedia.org/wiki/Carlos%20Fuentes", "body": "Carlos Fuentes (11 November 1928 – 15 May 2012) was a Mexican novelist, essayist, screenwriter, and diplomat. \n\nFuentes was born in Panama City, Panama. His father was a Mexican diplomat, and while Fuentes was growing up, the family moved to different countries in South America and then to the United States. \n\nHe got a degree in law from the National Autonomous University of Mexico, but instead of being a lawyer, he chose to be a diplomat and writer. He published his first novel, called La región más transparente (Where the Air Is Clear in English) in 1958. From 1975 to 1977, Fuentes was Mexico's ambassador to France. He died in Mexico City, Mexico from a haemorrhage.\n\nReferences\n\nOther websites \n\nPeople from Panama City\nDeaths from cardiovascular disease\nMexican historians\nMexican poets\nMexican journalists\nMexican novelists\nMexican screenwriters\n1928 births\n2012 deaths\nDisease-related deaths in Mexico"}, {"title": "Miguel Hidalgo", "link": "https://simple.wikipedia.org/wiki/Miguel%20Hidalgo", "body": "Miguel Hidalgo y Costilla (8 May, 1753 – 30 July, 1811) was a Mexican priest. He started Mexico's war of independence against Spain.\n\nHidalgo made a speech in 1810 now called the Grito de Dolores. He called on the people to support the King of Spain against the rebellious Viceroy of Mexico. After a few months he was taken prisoner and executed by firing squad. After he died, several other people, such as Vicente Guerrero, kept fighting against the Spanish until 1821, when Mexico became an independent country. Hidalgo is remembered today as a great liberator in Mexico.\n\nThe Mexican state of Hidalgo is named after him.\n\nReferences\n\nMexican poets\nPeople executed by firearm\n1753 births\n1811 deaths\nHidalgo (state)"}, {"title": "Nahuatl", "link": "https://simple.wikipedia.org/wiki/Nahuatl", "body": "The Nahuatl language is a language spoken by 1.5 million people, mostly in Mexico.\n\nHistory \nNahuatl has existed since the 7th century CE.\n\nThe first people to speak Nahuatl were indigenous peoples in central Mexico.  The Aztecs and the Toltecs spoke an early form of Nahuatl.\n\nThe people of Teotihuacan may have spoken Nahuatl.\n\nNahuatl has changed since the end of the Aztec Empire. Over time, many different dialects of Nahuatl have developed. Today, people who speak different Nahuatl dialects do not always understand each other.\n\nThe words \"Mexico,\" \"Guatemala,\" and \"Nicaragua\" all come from Nahuatl.\n\nUse today \nToday, most people who speak Nahuatl live in central Mexico. but  A few live in other parts of Mexico or in the United States.\n\nNahuatl is one of the official languages of Mexico. However, most people who speak Nahuatl now also speak Spanish.\n\nMany phrases that are unique to Mexican Spanish come from Nahuatl, according to John Lipski. The unique phrases are called \"Mexicanisms.\" An example is ándale, "}]